export default [
  { text: "主页", link: "/编程导航/" },
  {
    text: "关于我们",
    items: [
      { text: "主页", link: "/编程导航/关于我们/" },
      { text: "个人经历", link: "/编程导航/关于我们/个人经历" },
      { text: "星主介绍", link: "/编程导航/关于我们/星主介绍" },
    ],
  },
  { text: "加入编程导航", link: "/编程导航/加入编程导航" },
  { text: "真实评价", items: [{ text: "主页", link: "/编程导航/真实评价/" }] },
  { text: "编程导航年度总结", link: "/编程导航/编程导航年度总结" },
  {
    text: "编程导航故事",
    items: [
      { text: "主页", link: "/编程导航/编程导航故事/" },
      {
        text: "上岸分享",
        items: [
          { text: "上岸华为了！", link: "/编程导航/编程导航故事/上岸分享/上岸华为了！" },
          {
            text: "从失败到逆袭，我完成了目标！",
            link: "/编程导航/编程导航故事/上岸分享/从失败到逆袭，我完成了目标！",
          },
          {
            text: "从摆烂到逆袭，大二去蔚来了！",
            link: "/编程导航/编程导航故事/上岸分享/从摆烂到逆袭，大二去蔚来了！",
          },
          {
            text: "从躺平到上岸，我去了理想的大学！",
            link: "/编程导航/编程导航故事/上岸分享/从躺平到上岸，我去了理想的大学！",
          },
          {
            text: "大三摆烂到求职上岸，努力从来不晚！",
            link: "/编程导航/编程导航故事/上岸分享/大三摆烂到求职上岸，努力从来不晚！",
          },
          { text: "大厂工作一年半，我有话说！", link: "/编程导航/编程导航故事/上岸分享/大厂工作一年半，我有话说！" },
          {
            text: "字节实习转正了，这是我的秘诀",
            link: "/编程导航/编程导航故事/上岸分享/字节实习转正了，这是我的秘诀",
          },
          { text: "学弟找我来报喜了！", link: "/编程导航/编程导航故事/上岸分享/学弟找我来报喜了！" },
          { text: "学弟进小米了！", link: "/编程导航/编程导航故事/上岸分享/学弟进小米了！" },
          { text: "家里蹲半年，我终于上岸了！", link: "/编程导航/编程导航故事/上岸分享/家里蹲半年，我终于上岸了！" },
          { text: "我做了这些事，保研上岸985！", link: "/编程导航/编程导航故事/上岸分享/我做了这些事，保研上岸985！" },
          { text: "我的目标完成了！", link: "/编程导航/编程导航故事/上岸分享/我的目标完成了！" },
          { text: "春招上岸啦！", link: "/编程导航/编程导航故事/上岸分享/春招上岸啦！" },
          {
            text: "秋招上岸阿里，这是我的秘诀！",
            link: "/编程导航/编程导航故事/上岸分享/秋招上岸阿里，这是我的秘诀！",
          },
          { text: "非科班的我，也进了大厂！", link: "/编程导航/编程导航故事/上岸分享/非科班的我，也进了大厂！" },
          { text: "非科班转码，秋招上岸字节！", link: "/编程导航/编程导航故事/上岸分享/非科班转码，秋招上岸字节！" },
        ],
      },
      {
        text: "学习总结",
        items: [
          { text: "2022，我学会了这些！", link: "/编程导航/编程导航故事/学习总结/2022，我学会了这些！" },
          { text: "从摆烂到觉醒，梦想进大厂！", link: "/编程导航/编程导航故事/学习总结/从摆烂到觉醒，梦想进大厂！" },
          { text: "做了很多项目，说说我的感受", link: "/编程导航/编程导航故事/学习总结/做了很多项目，说说我的感受" },
          { text: "学弟这样学，稳了！", link: "/编程导航/编程导航故事/学习总结/学弟这样学，稳了！" },
          { text: "我今年最大的改变", link: "/编程导航/编程导航故事/学习总结/我今年最大的改变" },
          { text: "我最励志、最自律的一年", link: "/编程导航/编程导航故事/学习总结/我最励志、最自律的一年" },
          {
            text: "我这样准备蓝桥杯，拿国奖了！",
            link: "/编程导航/编程导航故事/学习总结/我这样准备蓝桥杯，拿国奖了！",
          },
        ],
      },
      {
        text: "星主分享",
        items: [
          { text: "一起讨论权限管理需求", link: "/编程导航/编程导航故事/星主分享/一起讨论权限管理需求" },
          { text: "怎么做个不用网络的软件？", link: "/编程导航/编程导航故事/星主分享/怎么做个不用网络的软件？" },
          {
            text: "我滴项目完成啦！！！伙伴匹配系统",
            link: "/编程导航/编程导航故事/星主分享/我滴项目完成啦！！！伙伴匹配系统",
          },
          {
            text: "我的项目完成啦！！！用户中心",
            link: "/编程导航/编程导航故事/星主分享/我的项目完成啦！！！用户中心",
          },
          {
            text: "新项目搞完啦！！！API开放平台",
            link: "/编程导航/编程导航故事/星主分享/新项目搞完啦！！！API开放平台",
          },
          {
            text: "新项目搞完啦！！！代码生成器共享平台",
            link: "/编程导航/编程导航故事/星主分享/新项目搞完啦！！！代码生成器共享平台",
          },
          {
            text: "新项目搞完啦！！！在线判题系统",
            link: "/编程导航/编程导航故事/星主分享/新项目搞完啦！！！在线判题系统",
          },
          {
            text: "新项目搞完啦！！！智能 BI 平台",
            link: "/编程导航/编程导航故事/星主分享/新项目搞完啦！！！智能 BI 平台",
          },
          {
            text: "新项目搞完啦！！！聚合搜索平台",
            link: "/编程导航/编程导航故事/星主分享/新项目搞完啦！！！聚合搜索平台",
          },
          {
            text: "新项目搞完啦！！！鱼答答 AI 答题应用平台",
            link: "/编程导航/编程导航故事/星主分享/新项目搞完啦！！！鱼答答 AI 答题应用平台",
          },
          { text: "鱼皮，你太细了！", link: "/编程导航/编程导航故事/星主分享/鱼皮，你太细了！" },
        ],
      },
      {
        text: "求职面经",
        items: [
          { text: "刚面完字节跳动，估计凉了", link: "/编程导航/编程导航故事/求职面经/刚面完字节跳动，估计凉了" },
          { text: "大二学弟刚面完字节，热乎！", link: "/编程导航/编程导航故事/求职面经/大二学弟刚面完字节，热乎！" },
          { text: "帮改简历，发现了一些通病！", link: "/编程导航/编程导航故事/求职面经/帮改简历，发现了一些通病！" },
          { text: "想旷课去参加实习了。。", link: "/编程导航/编程导航故事/求职面经/想旷课去参加实习了。。" },
        ],
      },
      {
        text: "球友经历",
        items: [
          {
            text: "一个人走得很快，一群人走得更远",
            link: "/编程导航/编程导航故事/球友经历/一个人走得很快，一群人走得更远",
          },
          {
            text: "从打螺丝到写代码，我的人生转折点！",
            link: "/编程导航/编程导航故事/球友经历/从打螺丝到写代码，我的人生转折点！",
          },
          { text: "从搬砖到测开，我的转码经历", link: "/编程导航/编程导航故事/球友经历/从搬砖到测开，我的转码经历" },
          {
            text: "从焊板子到敲代码，我的人生转折点！",
            link: "/编程导航/编程导航故事/球友经历/从焊板子到敲代码，我的人生转折点！",
          },
          {
            text: "从迷茫到醒悟，我明确了我的目标！",
            link: "/编程导航/编程导航故事/球友经历/从迷茫到醒悟，我明确了我的目标！",
          },
          { text: "从颓废到努力，这是我的故事", link: "/编程导航/编程导航故事/球友经历/从颓废到努力，这是我的故事" },
          { text: "全栈初中生，牛皮！", link: "/编程导航/编程导航故事/球友经历/全栈初中生，牛皮！" },
          { text: "创业失败，下定决心学编程！", link: "/编程导航/编程导航故事/球友经历/创业失败，下定决心学编程！" },
          { text: "别人要看源码，那我也要看", link: "/编程导航/编程导航故事/球友经历/别人要看源码，那我也要看" },
          { text: "大一学弟的寒假总结", link: "/编程导航/编程导航故事/球友经历/大一学弟的寒假总结" },
          { text: "大一学弟，真的很努力！", link: "/编程导航/编程导航故事/球友经历/大一学弟，真的很努力！" },
          { text: "大一，我想找实习！", link: "/编程导航/编程导航故事/球友经历/大一，我想找实习！" },
          {
            text: "小学就开始学编程了，恐怖如斯！",
            link: "/编程导航/编程导航故事/球友经历/小学就开始学编程了，恐怖如斯！",
          },
          {
            text: "小学就自学编程，还黑了学校的广播系统？",
            link: "/编程导航/编程导航故事/球友经历/小学就自学编程，还黑了学校的广播系统？",
          },
          { text: "开始认真了！", link: "/编程导航/编程导航故事/球友经历/开始认真了！" },
          {
            text: "迷茫四年后，我凭这点成功逆袭！",
            link: "/编程导航/编程导航故事/球友经历/迷茫四年后，我凭这点成功逆袭！",
          },
          {
            text: "都这个点儿了，这帮人竟然在。。。",
            link: "/编程导航/编程导航故事/球友经历/都这个点儿了，这帮人竟然在。。。",
          },
        ],
      },
      {
        text: "问题解惑",
        items: [
          {
            text: "刚入职新公司，代码看不懂咋办？",
            link: "/编程导航/编程导航故事/问题解惑/刚入职新公司，代码看不懂咋办？",
          },
          { text: "考研还是就业？经典问题", link: "/编程导航/编程导航故事/问题解惑/考研还是就业？经典问题" },
        ],
      },
    ],
  },
  {
    text: "编程导航直播",
    items: [
      { text: "主页", link: "/编程导航/编程导航直播/" },
      { text: "不就部署个网站么？还能玩出花来？", link: "/编程导航/编程导航直播/不就部署个网站么？还能玩出花来？" },
      { text: "嘉宾分享", link: "/编程导航/编程导航直播/嘉宾分享" },
      { text: "往期直播", link: "/编程导航/编程导航直播/往期直播" },
      { text: "给大学的弟妹们做了一场讲座", link: "/编程导航/编程导航直播/给大学的弟妹们做了一场讲座" },
    ],
  },
  {
    text: "编程导航资料",
    items: [
      { text: "专属交流群", link: "/编程导航/编程导航资料/专属交流群" },
      { text: "专属学习路线", link: "/编程导航/编程导航资料/专属学习路线" },
      { text: "学习资源", link: "/编程导航/编程导航资料/学习资源" },
      { text: "鱼皮的学习笔记", link: "/编程导航/编程导航资料/鱼皮的学习笔记" },
      { text: "鱼皮的打工日记", link: "/编程导航/编程导航资料/鱼皮的打工日记" },
    ],
  },
  {
    text: "编程导航项目",
    items: [
      { text: "AI 答题应用平台", link: "/编程导航/编程导航项目/AI 答题应用平台" },
      { text: "SQL 生成器项目", link: "/编程导航/编程导航项目/SQL 生成器项目" },
      { text: "Web 终端项目", link: "/编程导航/编程导航项目/Web 终端项目" },
      { text: "工作记录分析工具", link: "/编程导航/编程导航项目/工作记录分析工具" },
      { text: "编程导航奖励系统", link: "/编程导航/编程导航项目/编程导航奖励系统" },
      { text: "项目训练营", link: "/编程导航/编程导航项目/项目训练营" },
    ],
  },
];
