export default [
  { text: "主页", link: "/编程分享/" },
  {
    text: "个人作品",
    items: [
      {
        text: "代码小抄",
        items: [
          { text: "我们做的小工具上线啦！", link: "/编程分享/个人作品/代码小抄/我们做的小工具上线啦！" },
          { text: "我们做的小工具，爆了！", link: "/编程分享/个人作品/代码小抄/我们做的小工具，爆了！" },
        ],
      },
      {
        text: "其他",
        items: [
          { text: "520，我做了个表白网站生成器", link: "/编程分享/个人作品/其他/520，我做了个表白网站生成器" },
          { text: "一不小心创造了新的编程语言！", link: "/编程分享/个人作品/其他/一不小心创造了新的编程语言！" },
          {
            text: "喜迎新春，我做了一个祝福网站生成器",
            link: "/编程分享/个人作品/其他/喜迎新春，我做了一个祝福网站生成器",
          },
          { text: "大家好，我是小智！", link: "/编程分享/个人作品/其他/大家好，我是小智！" },
          {
            text: "奇思妙想，动手 DIY 你的浏览器主页",
            link: "/编程分享/个人作品/其他/奇思妙想，动手 DIY 你的浏览器主页",
          },
          { text: "带老弟做个实时排行榜", link: "/编程分享/个人作品/其他/带老弟做个实时排行榜" },
          { text: "愚皮做了一个 AI 编程昵称生成器", link: "/编程分享/个人作品/其他/愚皮做了一个 AI 编程昵称生成器" },
          { text: "我做了一款生成代码+数据的神器！", link: "/编程分享/个人作品/其他/我做了一款生成代码+数据的神器！" },
          { text: "我做了个很帅的网站！", link: "/编程分享/个人作品/其他/我做了个很帅的网站！" },
          { text: "我大三时做的羞耻项目！", link: "/编程分享/个人作品/其他/我大三时做的羞耻项目！" },
          {
            text: "我的新网站上线了！而且这次的制作方式有点不同",
            link: "/编程分享/个人作品/其他/我的新网站上线了！而且这次的制作方式有点不同",
          },
          {
            text: "我的毕业设计，时隔一年，仍感觉头秃",
            link: "/编程分享/个人作品/其他/我的毕业设计，时隔一年，仍感觉头秃",
          },
          { text: "我的表情包网站上线啦！", link: "/编程分享/个人作品/其他/我的表情包网站上线啦！" },
          { text: "我造了个轮子，完整开源！", link: "/编程分享/个人作品/其他/我造了个轮子，完整开源！" },
          { text: "看完这个，我直接把 SQL 刷通了！", link: "/编程分享/个人作品/其他/看完这个，我直接把 SQL 刷通了！" },
          { text: "羊了个羊，但是低配版", link: "/编程分享/个人作品/其他/羊了个羊，但是低配版" },
          { text: "自制 AI 问答机器人", link: "/编程分享/个人作品/其他/自制 AI 问答机器人" },
          { text: "这次我开源，别再打我啦！", link: "/编程分享/个人作品/其他/这次我开源，别再打我啦！" },
        ],
      },
      {
        text: "测试鸭-自学网站安全",
        items: [
          {
            text: "做了个找打的网站，拿去玩！",
            link: "/编程分享/个人作品/测试鸭-自学网站安全/做了个找打的网站，拿去玩！",
          },
          { text: "测试鸭开源", link: "/编程分享/个人作品/测试鸭-自学网站安全/测试鸭开源" },
        ],
      },
      {
        text: "编程导航-编程资源网",
        items: [
          {
            text: "假期结束，编程导航带着新功能来啦！",
            link: "/编程分享/个人作品/编程导航-编程资源网/假期结束，编程导航带着新功能来啦！",
          },
          {
            text: "爆肝 200 小时，我做了个编程导航！",
            link: "/编程分享/个人作品/编程导航-编程资源网/爆肝 200 小时，我做了个编程导航！",
          },
          {
            text: "爆肝！朋友做了个编程导航网站！",
            link: "/编程分享/个人作品/编程导航-编程资源网/爆肝！朋友做了个编程导航网站！",
          },
          { text: "给爸爸们汇报几件事！", link: "/编程分享/个人作品/编程导航-编程资源网/给爸爸们汇报几件事！" },
          {
            text: "编程导航诞生！轻松发现优质编程资源",
            link: "/编程分享/个人作品/编程导航-编程资源网/编程导航诞生！轻松发现优质编程资源",
          },
        ],
      },
      {
        text: "面试鸭-面试刷题网",
        items: [
          { text: "免费面试刷题网 - 面试鸭", link: "/编程分享/个人作品/面试鸭-面试刷题网/免费面试刷题网 - 面试鸭" },
          {
            text: "对不起，我的面试刷题网复活了！",
            link: "/编程分享/个人作品/面试鸭-面试刷题网/对不起，我的面试刷题网复活了！",
          },
          { text: "攻击面试鸭？进小黑屋！", link: "/编程分享/个人作品/面试鸭-面试刷题网/攻击面试鸭？进小黑屋！" },
          {
            text: "面试鸭网站，用到的技术讲解",
            link: "/编程分享/个人作品/面试鸭-面试刷题网/面试鸭网站，用到的技术讲解",
          },
        ],
      },
    ],
  },
  {
    text: "入门必看-学习路线",
    items: [
      { text: "主页", link: "/编程分享/入门必看-学习路线/" },
      { text: "如何学习GitHub？", link: "/编程分享/入门必看-学习路线/如何学习GitHub？" },
      { text: "如何自学编程？", link: "/编程分享/入门必看-学习路线/如何自学编程？" },
      {
        text: "编程入门到进大厂，你需要这套学习架构",
        link: "/编程分享/入门必看-学习路线/编程入门到进大厂，你需要这套学习架构",
      },
    ],
  },
  {
    text: "其他",
    items: [
      { text: "14 岁，3 次给我的项目贡献代码", link: "/编程分享/其他/14 岁，3 次给我的项目贡献代码" },
      { text: "你真的了解程序员么？做个测试吧！", link: "/编程分享/其他/你真的了解程序员么？做个测试吧！" },
      { text: "再次登上学生时代的个人博客，泪目", link: "/编程分享/其他/再次登上学生时代的个人博客，泪目" },
      { text: "大意了啊，不小心毁了一家公司", link: "/编程分享/其他/大意了啊，不小心毁了一家公司" },
      { text: "学前端的朋友做的个人博客", link: "/编程分享/其他/学前端的朋友做的个人博客" },
    ],
  },
  {
    text: "学习指南",
    items: [
      { text: "主页", link: "/编程分享/学习指南/" },
      {
        text: "学习建议",
        items: [
          {
            text: "Mac 和 Win，到底用哪个系统学编程？",
            link: "/编程分享/学习指南/学习建议/Mac 和 Win，到底用哪个系统学编程？",
          },
          { text: "一位非常认真的同学，赞之！", link: "/编程分享/学习指南/学习建议/一位非常认真的同学，赞之！" },
          { text: "为什么我强烈建议大家找实习？", link: "/编程分享/学习指南/学习建议/为什么我强烈建议大家找实习？" },
          { text: "别担心，我们都一样！", link: "/编程分享/学习指南/学习建议/别担心，我们都一样！" },
          { text: "后端，Linux 要学到什么程度？", link: "/编程分享/学习指南/学习建议/后端，Linux 要学到什么程度？" },
          {
            text: "大学，我是怎么边学编程边赚钱的？",
            link: "/编程分享/学习指南/学习建议/大学，我是怎么边学编程边赚钱的？",
          },
          { text: "如何正确地提问？", link: "/编程分享/学习指南/学习建议/如何正确地提问？" },
          { text: "如何正确选择编程学习资源？", link: "/编程分享/学习指南/学习建议/如何正确选择编程学习资源？" },
          { text: "如何高效找到优质编程项目？", link: "/编程分享/学习指南/学习建议/如何高效找到优质编程项目？" },
          {
            text: "学了十几种编程语言后，我有哪些感受？",
            link: "/编程分享/学习指南/学习建议/学了十几种编程语言后，我有哪些感受？",
          },
          { text: "学弟想做个高质量视频小程序", link: "/编程分享/学习指南/学习建议/学弟想做个高质量视频小程序" },
          {
            text: "我做了几个项目，还是啥都不会？",
            link: "/编程分享/学习指南/学习建议/我做了几个项目，还是啥都不会？",
          },
          { text: "我是后端，要学前端嘛？", link: "/编程分享/学习指南/学习建议/我是后端，要学前端嘛？" },
          {
            text: "我用了 6 年，告诉你怎么学好 Java",
            link: "/编程分享/学习指南/学习建议/我用了 6 年，告诉你怎么学好 Java",
          },
          {
            text: "拒绝拖延！我是怎么提高行动力的？",
            link: "/编程分享/学习指南/学习建议/拒绝拖延！我是怎么提高行动力的？",
          },
          {
            text: "挺看好的一位前端学妹，顶峰见！",
            link: "/编程分享/学习指南/学习建议/挺看好的一位前端学妹，顶峰见！",
          },
          {
            text: "挺看好的一位后端学弟，顶峰见！",
            link: "/编程分享/学习指南/学习建议/挺看好的一位后端学弟，顶峰见！",
          },
          { text: "有哪些参与项目的好途径？", link: "/编程分享/学习指南/学习建议/有哪些参与项目的好途径？" },
          {
            text: "沉淀 700 天，编程导航学习指南 2.0 发布了！",
            link: "/编程分享/学习指南/学习建议/沉淀 700 天，编程导航学习指南 2.0 发布了！",
          },
          { text: "现在做这几件事，一定好起来！", link: "/编程分享/学习指南/学习建议/现在做这几件事，一定好起来！" },
          {
            text: "老师看上了我的项目，还想申请个软著？！",
            link: "/编程分享/学习指南/学习建议/老师看上了我的项目，还想申请个软著？！",
          },
          { text: "考研结束后，抓紧做这件事！", link: "/编程分享/学习指南/学习建议/考研结束后，抓紧做这件事！" },
          {
            text: "谁说没实习经历，就不能进大厂了！",
            link: "/编程分享/学习指南/学习建议/谁说没实习经历，就不能进大厂了！",
          },
          { text: "这是用框架的通病么？", link: "/编程分享/学习指南/学习建议/这是用框架的通病么？" },
        ],
      },
      {
        text: "学习故事",
        items: [
          { text: "在烧烤店约了一位阿里练习生", link: "/编程分享/学习指南/学习故事/在烧烤店约了一位阿里练习生" },
          { text: "大一学弟的寒假总结，佩服！", link: "/编程分享/学习指南/学习故事/大一学弟的寒假总结，佩服！" },
          {
            text: "小学就自学编程，顺手黑了学校广播系统？",
            link: "/编程分享/学习指南/学习故事/小学就自学编程，顺手黑了学校广播系统？",
          },
          { text: "迷茫四年后,我凭这点成功逆袭!", link: "/编程分享/学习指南/学习故事/迷茫四年后,我凭这点成功逆袭!" },
        ],
      },
      {
        text: "方向选择",
        items: [
          {
            text: "如何看待 “Java 已死、前端已凉” 等言论？",
            link: "/编程分享/学习指南/方向选择/如何看待 “Java 已死、前端已凉” 等言论？",
          },
          { text: "学网站开发还是打 ACM？", link: "/编程分享/学习指南/方向选择/学网站开发还是打 ACM？" },
          {
            text: "感觉进大厂机会渺茫，要考研续命么？",
            link: "/编程分享/学习指南/方向选择/感觉进大厂机会渺茫，要考研续命么？",
          },
          { text: "考研还是就业？我当时也超纠结", link: "/编程分享/学习指南/方向选择/考研还是就业？我当时也超纠结" },
          { text: "聊聊编程语言的选择", link: "/编程分享/学习指南/方向选择/聊聊编程语言的选择" },
          { text: "选 C++ 还是 Java？", link: "/编程分享/学习指南/方向选择/选 C++ 还是 Java？" },
        ],
      },
      {
        text: "避坑指南",
        items: [
          { text: "一个好的编程习惯", link: "/编程分享/学习指南/避坑指南/一个好的编程习惯" },
          {
            text: "为什么我不建议大学生接公司单？",
            link: "/编程分享/学习指南/避坑指南/为什么我不建议大学生接公司单？",
          },
          {
            text: "几个对程序员的误解，害人不浅！",
            link: "/编程分享/学习指南/避坑指南/几个对程序员的误解，害人不浅！",
          },
          { text: "别人看源码，那我也要看！", link: "/编程分享/学习指南/避坑指南/别人看源码，那我也要看！" },
          {
            text: "大多数人不注意，这样写代码会有问题 ！",
            link: "/编程分享/学习指南/避坑指南/大多数人不注意，这样写代码会有问题 ！",
          },
          { text: "学编程，别为这事浪费时间！", link: "/编程分享/学习指南/避坑指南/学编程，别为这事浪费时间！" },
          { text: "学编程，千万不要轻易转行！", link: "/编程分享/学习指南/避坑指南/学编程，千万不要轻易转行！" },
          { text: "学编程，千万别背代码！", link: "/编程分享/学习指南/避坑指南/学编程，千万别背代码！" },
        ],
      },
    ],
  },
  {
    text: "实战教程",
    items: [
      {
        text: "Docsify + 云开发，高效创造你的文档网站",
        link: "/编程分享/实战教程/Docsify + 云开发，高效创造你的文档网站",
      },
      { text: "Java 处理表格，真的很爽！", link: "/编程分享/实战教程/Java 处理表格，真的很爽！" },
      { text: "VS Code 远程开发实战", link: "/编程分享/实战教程/VS Code 远程开发实战" },
      { text: "一起来做个免登录资源导航小程序吧", link: "/编程分享/实战教程/一起来做个免登录资源导航小程序吧" },
      {
        text: "五分钟，使用 Typora + PicGo 提升百倍写作效率",
        link: "/编程分享/实战教程/五分钟，使用 Typora + PicGo 提升百倍写作效率",
      },
      { text: "几分钟，教你搭个 AI 绘画平台~", link: "/编程分享/实战教程/几分钟，教你搭个 AI 绘画平台~" },
      { text: "几种简单免费的上线网站方法", link: "/编程分享/实战教程/几种简单免费的上线网站方法" },
      { text: "几行代码，竟然就能做个聊天室！", link: "/编程分享/实战教程/几行代码，竟然就能做个聊天室！" },
      { text: "如何用 5 分钟上线新网站？", link: "/编程分享/实战教程/如何用 5 分钟上线新网站？" },
      { text: "如何给知名开源项目贡献代码？", link: "/编程分享/实战教程/如何给知名开源项目贡献代码？" },
      {
        text: "实战开发类库，手写 Spring Boot Starter！",
        link: "/编程分享/实战教程/实战开发类库，手写 Spring Boot Starter！",
      },
      { text: "室友去厕所的功夫，我写了个计算器", link: "/编程分享/实战教程/室友去厕所的功夫，我写了个计算器" },
      { text: "尝鲜 Svelte 前端框架，开发读书笔记", link: "/编程分享/实战教程/尝鲜 Svelte 前端框架，开发读书笔记" },
      { text: "怎么做个不用网络的软件？", link: "/编程分享/实战教程/怎么做个不用网络的软件？" },
      { text: "我做了个工具，几秒就能生成项目！", link: "/编程分享/实战教程/我做了个工具，几秒就能生成项目！" },
      {
        text: "我单方面宣布，自己是 ChatGPT 程序员！",
        link: "/编程分享/实战教程/我单方面宣布，自己是 ChatGPT 程序员！",
      },
      { text: "我开源了一套 RPC 框架，学爆它！", link: "/编程分享/实战教程/我开源了一套 RPC 框架，学爆它！" },
      { text: "我用这个技术，干掉几千行 if else！", link: "/编程分享/实战教程/我用这个技术，干掉几千行 if else！" },
      { text: "搞台虚拟机玩玩！", link: "/编程分享/实战教程/搞台虚拟机玩玩！" },
      { text: "新项目搞完啦！代码生成器共享平台", link: "/编程分享/实战教程/新项目搞完啦！代码生成器共享平台" },
      { text: "炸裂的 AutoGPT，帮我做了个网站！", link: "/编程分享/实战教程/炸裂的 AutoGPT，帮我做了个网站！" },
      { text: "用我这套模板，几分钟做出文档网站！", link: "/编程分享/实战教程/用我这套模板，几分钟做出文档网站！" },
      { text: "腾讯公测云开发低码！全网首篇实战评测", link: "/编程分享/实战教程/腾讯公测云开发低码！全网首篇实战评测" },
      { text: "让你的 GitHub 秒变高大上！", link: "/编程分享/实战教程/让你的 GitHub 秒变高大上！" },
      { text: "让程序员老弟去做 PPT？白日做梦", link: "/编程分享/实战教程/让程序员老弟去做 PPT？白日做梦" },
      { text: "谁会拒绝一个免费的部署服务呢？", link: "/编程分享/实战教程/谁会拒绝一个免费的部署服务呢？" },
      { text: "魔改和上线你的合成大西瓜，最全教程", link: "/编程分享/实战教程/魔改和上线你的合成大西瓜，最全教程" },
    ],
  },
  {
    text: "开发经验",
    items: [
      { text: "1024，说说我这几年总结的小技巧！", link: "/编程分享/开发经验/1024，说说我这几年总结的小技巧！" },
      { text: "2分钟，我把网站性能优化了3倍！", link: "/编程分享/开发经验/2分钟，我把网站性能优化了3倍！" },
      { text: "GitHub 骚操作", link: "/编程分享/开发经验/GitHub 骚操作" },
      {
        text: "GitHub这5个骚操作，99%的人不知道！",
        link: "/编程分享/开发经验/GitHub这5个骚操作，百分之 99 的人不知道！",
      },
      { text: "主页", link: "/编程分享/开发经验/" },
      { text: "“这不是个大学生都能做吗？”", link: "/编程分享/开发经验/“这不是个大学生都能做吗？”" },
      { text: "为什么不要写 Hardcode？", link: "/编程分享/开发经验/为什么不要写 Hardcode？" },
      { text: "主流前后端项目部署方式", link: "/编程分享/开发经验/主流前后端项目部署方式" },
      { text: "做项目时要注意的点", link: "/编程分享/开发经验/做项目时要注意的点" },
      {
        text: "写了7年代码，第一次见这么狗血的小Bug！",
        link: "/编程分享/开发经验/写了7年代码，第一次见这么狗血的小Bug！",
      },
      { text: "刚入职新公司，代码看懵逼了咋办？", link: "/编程分享/开发经验/刚入职新公司，代码看懵逼了咋办？" },
      { text: "刚进公司就负责项目，把老弟整蒙了！", link: "/编程分享/开发经验/刚进公司就负责项目，把老弟整蒙了！" },
      { text: "千万别直接敲代码！", link: "/编程分享/开发经验/千万别直接敲代码！" },
      { text: "后端开发需要注意什么？", link: "/编程分享/开发经验/后端开发需要注意什么？" },
      { text: "员工写了个比删库更可怕的 Bug！", link: "/编程分享/开发经验/员工写了个比删库更可怕的 Bug！" },
      { text: "大厂做项目的流程", link: "/编程分享/开发经验/大厂做项目的流程" },
      { text: "大厂的 SDK 写法，偷学到了！", link: "/编程分享/开发经验/大厂的 SDK 写法，偷学到了！" },
      { text: "如何写好文档？", link: "/编程分享/开发经验/如何写好文档？" },
      { text: "如何用 IDEA 提升开发效率？", link: "/编程分享/开发经验/如何用 IDEA 提升开发效率？" },
      { text: "如何给知名开源项目贡献代码？", link: "/编程分享/开发经验/如何给知名开源项目贡献代码？" },
      { text: "如何解决数据查询为空的 Bug？", link: "/编程分享/开发经验/如何解决数据查询为空的 Bug？" },
      { text: "如何超前完成工作？", link: "/编程分享/开发经验/如何超前完成工作？" },
      { text: "如何避免配置文件中的密码被泄露？", link: "/编程分享/开发经验/如何避免配置文件中的密码被泄露？" },
      { text: "学会这招，一天做一个项目！", link: "/编程分享/开发经验/学会这招，一天做一个项目！" },
      { text: "常见的写 Bug 原因汇总", link: "/编程分享/开发经验/常见的写 Bug 原因汇总" },
      { text: "提高工作效率的秘诀", link: "/编程分享/开发经验/提高工作效率的秘诀" },
      { text: "服务器没挂，为啥无法访问？", link: "/编程分享/开发经验/服务器没挂，为啥无法访问？" },
      { text: "程序员绘图工具和技巧", link: "/编程分享/开发经验/程序员绘图工具和技巧" },
      { text: "编程大佬有哪些特点？", link: "/编程分享/开发经验/编程大佬有哪些特点？" },
      {
        text: "老子写个代码而已，凭什么还要我写文档？",
        link: "/编程分享/开发经验/老子写个代码而已，凭什么还要我写文档？",
      },
      { text: "解决 Bug 套路总结", link: "/编程分享/开发经验/解决 Bug 套路总结" },
      { text: "还能这么做需求？产品经理都吓到了", link: "/编程分享/开发经验/还能这么做需求？产品经理都吓到了" },
      {
        text: "迷的一批，上线了新功能，老功能就废了！",
        link: "/编程分享/开发经验/迷的一批，上线了新功能，老功能就废了！",
      },
      { text: "项目启动失败？不用慌！", link: "/编程分享/开发经验/项目启动失败？不用慌！" },
      { text: "项目本地跑的好，为啥上线全是 Bug？", link: "/编程分享/开发经验/项目本地跑的好，为啥上线全是 Bug？" },
      { text: "首次公开！我快速做项目的技巧", link: "/编程分享/开发经验/首次公开！我快速做项目的技巧" },
    ],
  },
  {
    text: "技术分享",
    items: [
      {
        text: "入门科普",
        items: [
          { text: "【设计模式】命令模式入门实战", link: "/编程分享/技术分享/入门科普/【设计模式】命令模式入门实战" },
          {
            text: "为什么程序员一定要写单元测试？",
            link: "/编程分享/技术分享/入门科普/为什么程序员一定要写单元测试？",
          },
          { text: "什么是 Linux？", link: "/编程分享/技术分享/入门科普/什么是 Linux？" },
          { text: "什么是无障碍技术？", link: "/编程分享/技术分享/入门科普/什么是无障碍技术？" },
          { text: "什么是负载均衡？", link: "/编程分享/技术分享/入门科普/什么是负载均衡？" },
          { text: "什么是魔数？", link: "/编程分享/技术分享/入门科普/什么是魔数？" },
          { text: "什么是魔法值？", link: "/编程分享/技术分享/入门科普/什么是魔法值？" },
          { text: "你真的会写单例模式么？", link: "/编程分享/技术分享/入门科普/你真的会写单例模式么？" },
          {
            text: "使用 FreeMarker 模板引擎生成代码",
            link: "/编程分享/技术分享/入门科普/使用 FreeMarker 模板引擎生成代码",
          },
          { text: "啥是前端 ？", link: "/编程分享/技术分享/入门科普/啥是前端 ？" },
          { text: "啥是区块链？", link: "/编程分享/技术分享/入门科普/啥是区块链？" },
          { text: "啥是数据库？", link: "/编程分享/技术分享/入门科普/啥是数据库？" },
          { text: "啥是重定向？", link: "/编程分享/技术分享/入门科普/啥是重定向？" },
          { text: "大的数据就是大数据？", link: "/编程分享/技术分享/入门科普/大的数据就是大数据？" },
          { text: "小白都能看懂的缓存入门", link: "/编程分享/技术分享/入门科普/小白都能看懂的缓存入门" },
        ],
      },
      {
        text: "技术实践",
        items: [
          {
            text: "4 种方法，帮你快速新建 Java 项目！",
            link: "/编程分享/技术分享/技术实践/4 种方法，帮你快速新建 Java 项目！",
          },
          { text: "一周上线百万级高并发系统", link: "/编程分享/技术分享/技术实践/一周上线百万级高并发系统" },
          {
            text: "万万没想到，这都能发现 Bug？！",
            link: "/编程分享/技术分享/技术实践/万万没想到，这都能发现 Bug？！",
          },
          { text: "不敢想，做个博客竟如此简单！", link: "/编程分享/技术分享/技术实践/不敢想，做个博客竟如此简单！" },
          {
            text: "从 0 到 1，看我玩弄千万日志于股掌",
            link: "/编程分享/技术分享/技术实践/从 0 到 1，看我玩弄千万日志于股掌",
          },
          { text: "使用 ES 优化网站搜索体验", link: "/编程分享/技术分享/技术实践/使用 ES 优化网站搜索体验" },
          {
            text: "使用内网穿透，1 分钟 “上线” 本地网站",
            link: "/编程分享/技术分享/技术实践/使用内网穿透，1 分钟 “上线” 本地网站",
          },
          {
            text: "做了个企微机器人，专门提醒员工接水？",
            link: "/编程分享/技术分享/技术实践/做了个企微机器人，专门提醒员工接水？",
          },
          {
            text: "写了7年代码，第一次见这么狗血的小Bug！",
            link: "/编程分享/技术分享/技术实践/写了7年代码，第一次见这么狗血的小Bug！",
          },
          {
            text: "利用好代码生成器，开发效率翻倍！",
            link: "/编程分享/技术分享/技术实践/利用好代码生成器，开发效率翻倍！",
          },
          {
            text: "千万别强制停机！我嘴都气歪了！",
            link: "/编程分享/技术分享/技术实践/千万别强制停机！我嘴都气歪了！",
          },
          {
            text: "大厂机密！30 个提升团队研发效能的锦囊",
            link: "/编程分享/技术分享/技术实践/大厂机密！30 个提升团队研发效能的锦囊",
          },
          { text: "如何去除字符串中的 n ？", link: "/编程分享/技术分享/技术实践/如何去除字符串中的 n ？" },
          { text: "如何预防 rm -rf ？", link: "/编程分享/技术分享/技术实践/如何预防 rm -rf ？" },
          {
            text: "快速部署微服务项目，保姆级教程",
            link: "/编程分享/技术分享/技术实践/快速部署微服务项目，保姆级教程",
          },
          { text: "我竟被这个 Bug 坑了一周！", link: "/编程分享/技术分享/技术实践/我竟被这个 Bug 坑了一周！" },
          { text: "扒个知名项目的 Bug！", link: "/编程分享/技术分享/技术实践/扒个知名项目的 Bug！" },
          { text: "揭秘软件开发的达摩克利斯之剑", link: "/编程分享/技术分享/技术实践/揭秘软件开发的达摩克利斯之剑" },
          {
            text: "搞了次性能优化，结果出乎意料！",
            link: "/编程分享/技术分享/技术实践/搞了次性能优化，结果出乎意料！",
          },
          { text: "文件上传下载，这样做最简单！", link: "/编程分享/技术分享/技术实践/文件上传下载，这样做最简单！" },
          { text: "气炸！又一次被编辑器坑了！", link: "/编程分享/技术分享/技术实践/气炸！又一次被编辑器坑了！" },
          {
            text: "用 Java 做个命令行程序，太简单了！",
            link: "/编程分享/技术分享/技术实践/用 Java 做个命令行程序，太简单了！",
          },
          { text: "编程导航，凉凉！", link: "/编程分享/技术分享/技术实践/编程导航，凉凉！" },
          { text: "老弟做了个网盘，炸了！", link: "/编程分享/技术分享/技术实践/老弟做了个网盘，炸了！" },
          { text: "被攻击了！事后分析", link: "/编程分享/技术分享/技术实践/被攻击了！事后分析" },
          { text: "记一次前端长整数精度丢失问题", link: "/编程分享/技术分享/技术实践/记一次前端长整数精度丢失问题" },
          { text: "越自信，Bug 越多", link: "/编程分享/技术分享/技术实践/越自信，Bug 越多" },
          { text: "这个Bug，给我整得一愣一愣！", link: "/编程分享/技术分享/技术实践/这个Bug，给我整得一愣一愣！" },
          { text: "这些代码，差点把我气出内伤", link: "/编程分享/技术分享/技术实践/这些代码，差点把我气出内伤" },
        ],
      },
      {
        text: "技术知识",
        items: [
          { text: "00 后架构师，那可能么？", link: "/编程分享/技术分享/技术知识/00 后架构师，那可能么？" },
          { text: "B 站崩盘事故分析", link: "/编程分享/技术分享/技术知识/B 站崩盘事故分析" },
          { text: "Git 提交竟然还能这么用？", link: "/编程分享/技术分享/技术知识/Git 提交竟然还能这么用？" },
          {
            text: "上线网站，谨慎使用按量计费服务！",
            link: "/编程分享/技术分享/技术知识/上线网站，谨慎使用按量计费服务！",
          },
          { text: "前后端分离，千万别再搞错了！", link: "/编程分享/技术分享/技术知识/前后端分离，千万别再搞错了！" },
          { text: "反向压力", link: "/编程分享/技术分享/技术知识/反向压力" },
          { text: "啥是热数据探测？", link: "/编程分享/技术分享/技术知识/啥是热数据探测？" },
          { text: "多环境", link: "/编程分享/技术分享/技术知识/多环境" },
          {
            text: "想做个代码生成器平台，怎么办？",
            link: "/编程分享/技术分享/技术知识/想做个代码生成器平台，怎么办？",
          },
          { text: "我们学并发时，到底在学什么？", link: "/编程分享/技术分享/技术知识/我们学并发时，到底在学什么？" },
          {
            text: "我敢打赌，这个架构你一定知道！",
            link: "/编程分享/技术分享/技术知识/我敢打赌，这个架构你一定知道！",
          },
          {
            text: "我用了多年的前端框架，强烈推荐！",
            link: "/编程分享/技术分享/技术知识/我用了多年的前端框架，强烈推荐！",
          },
          { text: "手写 OJ 系统，真的很难么？", link: "/编程分享/技术分享/技术知识/手写 OJ 系统，真的很难么？" },
          { text: "搜索引擎工作原理", link: "/编程分享/技术分享/技术知识/搜索引擎工作原理" },
          {
            text: "腾讯又出王炸产品！分分钟开发 AI 文档助手",
            link: "/编程分享/技术分享/技术知识/腾讯又出王炸产品！分分钟开发 AI 文档助手",
          },
          {
            text: "语雀 P0 事故复盘，这 9 个字亮了！",
            link: "/编程分享/技术分享/技术知识/语雀 P0 事故复盘，这 9 个字亮了！",
          },
          {
            text: "除了 MySQL，这些数据库你都认识么？",
            link: "/编程分享/技术分享/技术知识/除了 MySQL，这些数据库你都认识么？",
          },
        ],
      },
    ],
  },
  {
    text: "求职经验",
    items: [
      {
        text: "Offer选择",
        items: [
          {
            text: "offer 选择难？说说我的 2 个思考",
            link: "/编程分享/求职经验/Offer选择/offer 选择难？说说我的 2 个思考",
          },
          {
            text: "年少不知 Base 好，错把总包当成宝。。",
            link: "/编程分享/求职经验/Offer选择/年少不知 Base 好，错把总包当成宝。。",
          },
        ],
      },
      {
        text: "实习",
        items: [
          { text: "刚来实习就跑路，可行么？", link: "/编程分享/求职经验/实习/刚来实习就跑路，可行么？" },
          { text: "字节实习转正了，这是我的秘诀", link: "/编程分享/求职经验/实习/字节实习转正了，这是我的秘诀" },
          { text: "实习天天crud，很迷茫...", link: "/编程分享/求职经验/实习/实习天天crud，很迷茫..." },
          { text: "实习相关问题", link: "/编程分享/求职经验/实习/实习相关问题" },
          { text: "想旷课去参加实习了。。", link: "/编程分享/求职经验/实习/想旷课去参加实习了。。" },
          {
            text: "谁说没实习经历，就不能进大厂了！",
            link: "/编程分享/求职经验/实习/谁说没实习经历，就不能进大厂了！",
          },
        ],
      },
      {
        text: "求职建议",
        items: [
          { text: "不要慌，我有几个小建议！", link: "/编程分享/求职经验/求职建议/不要慌，我有几个小建议！" },
          {
            text: "从小公司到大厂，重点都考什么？",
            link: "/编程分享/求职经验/求职建议/从小公司到大厂，重点都考什么？",
          },
          { text: "刚考完研，怎么去准备春招？", link: "/编程分享/求职经验/求职建议/刚考完研，怎么去准备春招？" },
          { text: "春招，启动！", link: "/编程分享/求职经验/求职建议/春招，启动！" },
          { text: "给学弟几个找工作的重要信息", link: "/编程分享/求职经验/求职建议/给学弟几个找工作的重要信息" },
          { text: "给学弟妹们的秋招建议！", link: "/编程分享/求职经验/求职建议/给学弟妹们的秋招建议！" },
          { text: "考研结束，抓紧做这件事！", link: "/编程分享/求职经验/求职建议/考研结束，抓紧做这件事！" },
          { text: "说说我最近招人的感受", link: "/编程分享/求职经验/求职建议/说说我最近招人的感受" },
          { text: "说说我最近筛简历和面试的感受", link: "/编程分享/求职经验/求职建议/说说我最近筛简历和面试的感受" },
          { text: "项目撞车不可怕，谁 X 谁尴尬", link: "/编程分享/求职经验/求职建议/项目撞车不可怕，谁 X 谁尴尬" },
        ],
      },
      {
        text: "求职故事",
        items: [
          {
            text: "刚入职大厂，老板让我转语言。。",
            link: "/编程分享/求职经验/求职故事/刚入职大厂，老板让我转语言。。",
          },
          { text: "我们实习生的求职总结~", link: "/编程分享/求职经验/求职故事/我们实习生的求职总结~" },
          { text: "我被面试官 “耍” 了么？", link: "/编程分享/求职经验/求职故事/我被面试官 “耍” 了么？" },
          {
            text: "拼多多转正了，我却有些迷茫。。",
            link: "/编程分享/求职经验/求职故事/拼多多转正了，我却有些迷茫。。",
          },
          { text: "某位鱼友的春招上岸之路", link: "/编程分享/求职经验/求职故事/某位鱼友的春招上岸之路" },
          { text: "给大家鼓鼓劲！", link: "/编程分享/求职经验/求职故事/给大家鼓鼓劲！" },
          { text: "老板说我能力不行，怎么办？", link: "/编程分享/求职经验/求职故事/老板说我能力不行，怎么办？" },
        ],
      },
      {
        text: "简历技巧",
        items: [
          {
            text: "关于简历造假，只能说太 “勇” 了",
            link: "/编程分享/求职经验/简历技巧/关于简历造假，只能说太 “勇” 了",
          },
          {
            text: "内推学弟进了腾讯，看看他的标杆简历！",
            link: "/编程分享/求职经验/简历技巧/内推学弟进了腾讯，看看他的标杆简历！",
          },
          {
            text: "帮大二创业的学弟优化简历，分享经验",
            link: "/编程分享/求职经验/简历技巧/帮大二创业的学弟优化简历，分享经验",
          },
          { text: "帮改简历，发现了一些 “通病”", link: "/编程分享/求职经验/简历技巧/帮改简历，发现了一些 “通病”" },
          { text: "投简历没回复？先做到这点。。", link: "/编程分享/求职经验/简历技巧/投简历没回复？先做到这点。。" },
          { text: "简历项目造假，被发现了", link: "/编程分享/求职经验/简历技巧/简历项目造假，被发现了" },
          { text: "自我介绍，千万别来虚的！", link: "/编程分享/求职经验/简历技巧/自我介绍，千万别来虚的！" },
        ],
      },
      {
        text: "面经",
        items: [
          { text: "二本非科班，逆袭进大厂了！", link: "/编程分享/求职经验/面经/二本非科班，逆袭进大厂了！" },
          { text: "从家里到阿里，学弟超神的一年", link: "/编程分享/求职经验/面经/从家里到阿里，学弟超神的一年" },
          {
            text: "双非非科班，一年逆袭百度！完整面经",
            link: "/编程分享/求职经验/面经/双非非科班，一年逆袭百度！完整面经",
          },
          { text: "大二学弟刚面完字节，热乎！", link: "/编程分享/求职经验/面经/大二学弟刚面完字节，热乎！" },
          { text: "直系学弟进华为啦！", link: "/编程分享/求职经验/面经/直系学弟进华为啦！" },
        ],
      },
      {
        text: "面试题",
        items: [
          { text: "从小公司到大厂，重点都考什么？", link: "/编程分享/求职经验/面试题/从小公司到大厂，重点都考什么？" },
          { text: "坏了，我把面试重点搞错了！", link: "/编程分享/求职经验/面试题/坏了，我把面试重点搞错了！" },
          {
            text: "腾讯二面，我被 “赛马” 问题难住了",
            link: "/编程分享/求职经验/面试题/腾讯二面，我被 “赛马” 问题难住了",
          },
          { text: "送老弟去大厂面试，后端考点分享", link: "/编程分享/求职经验/面试题/送老弟去大厂面试，后端考点分享" },
          { text: "面试被问性能优化，被考倒了。。", link: "/编程分享/求职经验/面试题/面试被问性能优化，被考倒了。。" },
        ],
      },
    ],
  },
  {
    text: "科技科普",
    items: [
      {
        text: "科技资讯",
        items: [
          { text: "Gitee 很无奈！", link: "/编程分享/科技科普/科技资讯/Gitee 很无奈！" },
          { text: "IE 今天正式停用！网友炸锅了", link: "/编程分享/科技科普/科技资讯/IE 今天正式停用！网友炸锅了" },
          { text: "Log4j，炸了！！！", link: "/编程分享/科技科普/科技资讯/Log4j，炸了！！！" },
          {
            text: "Spring Boot 船新版本？我却很失望",
            link: "/编程分享/科技科普/科技资讯/Spring Boot 船新版本？我却很失望",
          },
          {
            text: "人人都能免费用的 AI 工具，开发效率翻倍！",
            link: "/编程分享/科技科普/科技资讯/人人都能免费用的 AI 工具，开发效率翻倍！",
          },
          { text: "恐怖的 GPT4！我也入局了", link: "/编程分享/科技科普/科技资讯/恐怖的 GPT4！我也入局了" },
          {
            text: "我刚买了永久会员，你就下线了？！",
            link: "/编程分享/科技科普/科技资讯/我刚买了永久会员，你就下线了？！",
          },
          { text: "我和 AI 的故事", link: "/编程分享/科技科普/科技资讯/我和 AI 的故事" },
          { text: "摔到老三的 Java，未来在哪？", link: "/编程分享/科技科普/科技资讯/摔到老三的 Java，未来在哪？" },
          {
            text: "无语，又一个知名项目收费了。。。已卸载",
            link: "/编程分享/科技科普/科技资讯/无语，又一个知名项目收费了。。。已卸载",
          },
          {
            text: "时代变了，Spring 官方抛弃了 Java 8！",
            link: "/编程分享/科技科普/科技资讯/时代变了，Spring 官方抛弃了 Java 8！",
          },
          { text: "百度终于要出手了？", link: "/编程分享/科技科普/科技资讯/百度终于要出手了？" },
          { text: "看了华为鸿蒙发布会，泼盆冷水", link: "/编程分享/科技科普/科技资讯/看了华为鸿蒙发布会，泼盆冷水" },
          { text: "离谱！", link: "/编程分享/科技科普/科技资讯/离谱！" },
          { text: "突发！Gitee 图床，废了！", link: "/编程分享/科技科普/科技资讯/突发！Gitee 图床，废了！" },
          { text: "腾讯，1000 亿！", link: "/编程分享/科技科普/科技资讯/腾讯，1000 亿！" },
          { text: "西安健康码又崩了！随便聊聊", link: "/编程分享/科技科普/科技资讯/西安健康码又崩了！随便聊聊" },
        ],
      },
      {
        text: "科普",
        items: [
          {
            text: "穿背心的老院士，86岁，重病，还在敲代码，单手",
            link: "/编程分享/科技科普/科普/穿背心的老院士，86岁，重病，还在敲代码，单手",
          },
          { text: "计算机女神，互联网第一夫人", link: "/编程分享/科技科普/科普/计算机女神，互联网第一夫人" },
        ],
      },
    ],
  },
  {
    text: "编程资源",
    items: [
      {
        text: "其他",
        items: [
          { text: "B 站 UP 主推荐", link: "/编程分享/编程资源/其他/B 站 UP 主推荐" },
          { text: "几个今年超火的编程网站！", link: "/编程分享/编程资源/其他/几个今年超火的编程网站！" },
          { text: "这些网站，陪我过了 5 年", link: "/编程分享/编程资源/其他/这些网站，陪我过了 5 年" },
        ],
      },
      {
        text: "学习资源",
        items: [
          { text: "10个宝藏级编程资源", link: "/编程分享/编程资源/学习资源/10个宝藏级编程资源" },
          { text: "Java 文档教程大汇总", link: "/编程分享/编程资源/学习资源/Java 文档教程大汇总" },
          { text: "Java 源码教程项目大汇总", link: "/编程分享/编程资源/学习资源/Java 源码教程项目大汇总" },
          { text: "Java 知识总结项目大汇总", link: "/编程分享/编程资源/学习资源/Java 知识总结项目大汇总" },
          { text: "分享一套保姆级 Java 教程", link: "/编程分享/编程资源/学习资源/分享一套保姆级 Java 教程" },
          { text: "刷算法的资源分享", link: "/编程分享/编程资源/学习资源/刷算法的资源分享" },
          { text: "帮你学英语的项目", link: "/编程分享/编程资源/学习资源/帮你学英语的项目" },
          { text: "快速发现优秀开源项目的三板斧", link: "/编程分享/编程资源/学习资源/快速发现优秀开源项目的三板斧" },
          { text: "汇总一波免费 Python 资源", link: "/编程分享/编程资源/学习资源/汇总一波免费 Python 资源" },
          { text: "程序员如何赚钱的小书", link: "/编程分享/编程资源/学习资源/程序员如何赚钱的小书" },
          { text: "编程导航免费学习资源汇总", link: "/编程分享/编程资源/学习资源/编程导航免费学习资源汇总" },
        ],
      },
      {
        text: "开发工具",
        items: [
          { text: "3分钟，给女朋友做个云笔记！", link: "/编程分享/编程资源/开发工具/3分钟，给女朋友做个云笔记！" },
          { text: "Java 爬虫库推荐", link: "/编程分享/编程资源/开发工具/Java 爬虫库推荐" },
          { text: "一个免费、不怕打的评论插件！", link: "/编程分享/编程资源/开发工具/一个免费、不怕打的评论插件！" },
          {
            text: "一个厉害的小工具，小黑子都在用！",
            link: "/编程分享/编程资源/开发工具/一个厉害的小工具，小黑子都在用！",
          },
          { text: "一键对比 30 种编程语言的工具", link: "/编程分享/编程资源/开发工具/一键对比 30 种编程语言的工具" },
          {
            text: "一键生成几千套代码模板的前端神器",
            link: "/编程分享/编程资源/开发工具/一键生成几千套代码模板的前端神器",
          },
          { text: "免费好用的内网穿透工具", link: "/编程分享/编程资源/开发工具/免费好用的内网穿透工具" },
          {
            text: "几个测试接口的好工具，效率加倍~",
            link: "/编程分享/编程资源/开发工具/几个测试接口的好工具，效率加倍~",
          },
          { text: "分享几个好用免费的图床", link: "/编程分享/编程资源/开发工具/分享几个好用免费的图床" },
          {
            text: "微信发力了，一键部署网站后端！",
            link: "/编程分享/编程资源/开发工具/微信发力了，一键部署网站后端！",
          },
          {
            text: "我们公司都用哪些软件？强烈推荐这些",
            link: "/编程分享/编程资源/开发工具/我们公司都用哪些软件？强烈推荐这些",
          },
          { text: "我写代码的十八般兵器！", link: "/编程分享/编程资源/开发工具/我写代码的十八般兵器！" },
          { text: "我工作中不可或缺的宝贝们", link: "/编程分享/编程资源/开发工具/我工作中不可或缺的宝贝们" },
          { text: "抱歉，我不用别的测试工具了！", link: "/编程分享/编程资源/开发工具/抱歉，我不用别的测试工具了！" },
          { text: "用了这个 Java 小工具，我废了", link: "/编程分享/编程资源/开发工具/用了这个 Java 小工具，我废了" },
          {
            text: "精品 IDEA 插件大汇总！值得收藏",
            link: "/编程分享/编程资源/开发工具/精品 IDEA 插件大汇总！值得收藏",
          },
        ],
      },
      {
        text: "项目推荐",
        items: [
          {
            text: "N 年沉淀，腾讯这套系统终于开源！",
            link: "/编程分享/编程资源/项目推荐/N 年沉淀，腾讯这套系统终于开源！",
          },
          {
            text: "你的 GitHub 年总结视频，这个项目火了！",
            link: "/编程分享/编程资源/项目推荐/你的 GitHub 年总结视频，这个项目火了！",
          },
          {
            text: "几个免费的富文本编辑器，这不完胜付费？",
            link: "/编程分享/编程资源/项目推荐/几个免费的富文本编辑器，这不完胜付费？",
          },
          {
            text: "前端福音，蚂蚁金服 Ant Design 生态一览",
            link: "/编程分享/编程资源/项目推荐/前端福音，蚂蚁金服 Ant Design 生态一览",
          },
          { text: "又火一个前端项目", link: "/编程分享/编程资源/项目推荐/又火一个前端项目" },
          { text: "字节前端终于开源！吹爆！", link: "/编程分享/编程资源/项目推荐/字节前端终于开源！吹爆！" },
          { text: "很多网站，根本不用自己做！", link: "/编程分享/编程资源/项目推荐/很多网站，根本不用自己做！" },
          {
            text: "用 Git 操作的数据库？这个项目火了！",
            link: "/编程分享/编程资源/项目推荐/用 Git 操作的数据库？这个项目火了！",
          },
          { text: "腾讯的内部分享，大赞！", link: "/编程分享/编程资源/项目推荐/腾讯的内部分享，大赞！" },
          { text: "这 10 个创意项目，太顶了！", link: "/编程分享/编程资源/项目推荐/这 10 个创意项目，太顶了！" },
        ],
      },
    ],
  },
  {
    text: "职场经验",
    items: [
      { text: "23 岁，我担心中年危机", link: "/编程分享/职场经验/23 岁，我担心中年危机" },
      { text: "主页", link: "/编程分享/职场经验/" },
      { text: "入职第一天，想跑路了！", link: "/编程分享/职场经验/入职第一天，想跑路了！" },
      { text: "在车上偶遇一位阿里大佬！", link: "/编程分享/职场经验/在车上偶遇一位阿里大佬！" },
      { text: "工作一年，天天 CRUD。。", link: "/编程分享/职场经验/工作一年，天天 CRUD。。" },
      { text: "要是工作前就知道这个，该多好！", link: "/编程分享/职场经验/要是工作前就知道这个，该多好！" },
    ],
  },
  {
    text: "项目教程",
    items: [
      { text: "主页", link: "/编程分享/项目教程/" },
      {
        text: "保姆级实战项目教程",
        items: [
          { text: "实战项目 - API 开放平台", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目 - API 开放平台" },
          { text: "实战项目 - OJ 判题系统", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目 - OJ 判题系统" },
          { text: "实战项目 - 伙伴匹配系统", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目 - 伙伴匹配系统" },
          { text: "实战项目 - 智能 BI 平台", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目 - 智能 BI 平台" },
          { text: "实战项目 - 用户中心平台", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目 - 用户中心平台" },
          { text: "实战项目 - 聚合搜索平台", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目 - 聚合搜索平台" },
          { text: "实战项目代码开源了！", link: "/编程分享/项目教程/保姆级实战项目教程/实战项目代码开源了！" },
        ],
      },
      {
        text: "项目导学",
        items: [
          { text: "项目导学 - 尚医通", link: "/编程分享/项目教程/项目导学/项目导学 - 尚医通" },
          { text: "项目导学 - 瑞吉外卖", link: "/编程分享/项目教程/项目导学/项目导学 - 瑞吉外卖" },
          { text: "项目导学 - 硅谷课堂", link: "/编程分享/项目教程/项目导学/项目导学 - 硅谷课堂" },
          { text: "项目导学 - 黑马点评", link: "/编程分享/项目教程/项目导学/项目导学 - 黑马点评" },
        ],
      },
    ],
  },
];
