export default [
  { text: "主页", link: "/产品服务/" },
  {
    text: "产品",
    items: [
      {
        text: "代码小抄",
        items: [
          { text: "工具 - 简单易用的代码分享神器", link: "/产品服务/产品/代码小抄/工具 - 简单易用的代码分享神器" },
        ],
      },
      {
        text: "剪切板助手",
        items: [{ text: "工具 - 高颜值的剪切板助手", link: "/产品服务/产品/剪切板助手/工具 - 高颜值的剪切板助手" }],
      },
      {
        text: "老鱼简历",
        items: [
          {
            text: "我做了个网站，帮你写出满分简历！",
            link: "/产品服务/产品/老鱼简历/我做了个网站，帮你写出满分简历！",
          },
          { text: "我在简历上写了这个，超级加分！", link: "/产品服务/产品/老鱼简历/我在简历上写了这个，超级加分！" },
          {
            text: "要来了我们实习生的简历，仅供参考。。",
            link: "/产品服务/产品/老鱼简历/要来了我们实习生的简历，仅供参考。。",
          },
        ],
      },
      {
        text: "鱼聪明",
        items: [{ text: "工具 - 无门槛 AI 对话绘画神器", link: "/产品服务/产品/鱼聪明/工具 - 无门槛 AI 对话绘画神器" }],
      },
    ],
  },
  { text: "前端突击 - 前端面试训练营", link: "/产品服务/前端突击 - 前端面试训练营" },
  { text: "后端突击 - 狂飙后端训练营", link: "/产品服务/后端突击 - 狂飙后端训练营" },
  { text: "嵌入式 - 零基础到就业课程", link: "/产品服务/嵌入式 - 零基础到就业课程" },
  { text: "求职 - 帮你写好简历的神器", link: "/产品服务/求职 - 帮你写好简历的神器" },
  {
    text: "编程学习",
    items: [
      {
        text: "后端求职突击-狂飙训练营",
        items: [
          { text: "150位，我们出成果了！", link: "/产品服务/编程学习/后端求职突击-狂飙训练营/150位，我们出成果了！" },
        ],
      },
      {
        text: "编程宝典",
        items: [{ text: "我的编程宝典网站上线啦！", link: "/产品服务/编程学习/编程宝典/我的编程宝典网站上线啦！" }],
      },
    ],
  },
  { text: "考研陪跑 - 编程导航计狗上岸", link: "/产品服务/考研陪跑 - 编程导航计狗上岸" },
];
